zup/ЗУП_бюджет/src/Enums/ОтношениеНачисленийКДенежномуСодержанию/ОтношениеНачисленийКДенежномуСодержанию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтношениеНачисленийКДенежномуСодержанию</name>
  <enumValues>
    <name>ДолжностнойОклад</name>
  </enumValues>
  <enumValues>
    <name>ОкладЗаКлассныйЧин</name>
  </enumValues>
  <enumValues>
    <name>ЕдиноеДенежноеВознаграждение</name>
  </enumValues>
  <enumValues>
    <name>НадбавкаЗаВыслугуЛет</name>
  </enumValues>
  <enumValues>
    <name>НадбавкаЗаОсобыеУсловияСлужбы</name>
  </enumValues>
  <enumValues>
    <name>НадбавкаЗаСекретность</name>
  </enumValues>
  <enumValues>
    <name>ЕжемесячноеДенежноеПоощрение</name>
  </enumValues>
  <enumValues>
    <name>ПремияЗаОсобоВажныеИСложныеЗадания</name>
  </enumValues>
  <enumValues>
    <name>ЕдиновременнаяВыплатаКОтпуску</name>
  </enumValues>
  <enumValues>
    <name>МатериальнаяПомощь</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеЕжемесячныеВыплаты</name>
    <comment>Только для муниципальных служащих</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеВыплаты</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/ОтношениеНачисленийКДенежномуСодержанию/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ГосударственнаяСлужбаВызовСервера.ОтношениеНачисленийКДенежномуСодержаниюОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры
	
#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ДоступныеЗначения() Экспорт
	
	ДоступныеЗначения = Новый Массив;
	
	ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЗначенияПеречисления.ДолжностнойОклад);
	ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЗначенияПеречисления.ЕжемесячноеДенежноеПоощрение);
	ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЗначенияПеречисления.ЕдиновременнаяВыплатаКОтпуску);
	ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЗначенияПеречисления.МатериальнаяПомощь);
	ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЗначенияПеречисления.НадбавкаЗаВыслугуЛет);
	ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЗначенияПеречисления.НадбавкаЗаОсобыеУсловияСлужбы);
	ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЗначенияПеречисления.НадбавкаЗаСекретность);
	ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЗначенияПеречисления.ПремияЗаОсобоВажныеИСложныеЗадания);
	ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЗначенияПеречисления.ПрочиеВыплаты);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьГосударственнуюСлужбу") Тогда
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЗначенияПеречисления.ОкладЗаКлассныйЧин);
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЗначенияПеречисления.ЕдиноеДенежноеВознаграждение);
	ИначеЕсли ПолучитьФункциональнуюОпцию("ИспользоватьМуниципальнуюСлужбу") Тогда
		ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЗначенияПеречисления.ПрочиеЕжемесячныеВыплаты);
		Если ПолучитьФункциональнуюОпцию("НачислятьОкладЗаКлассныйЧинМуниципальнымСлужащим") Тогда
			ДоступныеЗначения.Добавить(Метаданные.Перечисления.ОтношениеНачисленийКДенежномуСодержанию.ЗначенияПеречисления.ОкладЗаКлассныйЧин);	
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДоступныеЗначения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
